# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names=pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [3]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names=baby_names.drop(columns=['Unnamed: 0','Id'])

In [5]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names.loc[baby_names['Gender']=='M'].count()

Name      457549
Year      457549
Gender    457549
State     457549
Count     457549
dtype: int64

In [7]:
baby_names.loc[baby_names['Gender']=='F'].count()

Name      558846
Year      558846
Gender    558846
State     558846
Count     558846
dtype: int64

### Step 7. Group the dataset by name and assign to names

In [8]:
names=baby_names.groupby(['Name'])

In [9]:
names.head()

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1004923  Gryffin  2014      M    WI      5
1004950     Kroy  2014      M    WI      5
1004973     Owyn  2014      M    WI      5
1005707   Haylea  2005      F    WV      5
1012216  Coalton  2012      M    WV      7

[65502 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [10]:
names.size()

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Length: 17632, dtype: int64

In [14]:
names['Name'].unique()

Name
Aaban        [Aaban]
Aadan        [Aadan]
Aadarsh    [Aadarsh]
Aaden        [Aaden]
Aadhav      [Aadhav]
             ...
Zyra          [Zyra]
Zyrah        [Zyrah]
Zyren        [Zyren]
Zyria        [Zyria]
Zyriah      [Zyriah]
Name: Name, Length: 17632, dtype: object

### Step 9. What is the name with most occurrences?

In [24]:
baby_names.groupby(['Name']).count().sort_values('Count', ascending=False).head(1)

       Year  Gender  State  Count
Name
Riley  1112    1112   1112   1112

### Step 10. How many different names have the least occurrences?

In [25]:
baby_names.groupby(['Name']).count().sort_values('Count').head(1)

           Year  Gender  State  Count
Name
Katherina     1       1      1      1

### Step 11. What is the median name occurrence?

In [26]:
names.median()

           Year  Count
Name
Aaban    2013.5    6.0
Aadan    2008.5    5.5
Aadarsh  2009.0    5.0
Aaden    2010.0   10.0
Aadhav   2014.0    6.0
...         ...    ...
Zyra     2013.0    6.0
Zyrah    2012.0    5.5
Zyren    2013.0    6.0
Zyria    2008.0    6.0
Zyriah   2009.0    6.0

[17632 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [27]:
names.std()

             Year      Count
Name
Aaban    0.707107   0.000000
Aadan    2.872281   0.957427
Aadarsh       NaN        NaN
Aaden    2.044322  21.154974
Aadhav        NaN        NaN
...           ...        ...
Zyra     2.115701   1.154701
Zyrah    1.414214   0.707107
Zyren         NaN        NaN
Zyria    2.685351   0.737865
Zyriah   2.915476   1.666667

[17632 rows x 2 columns]

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [28]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03